#Завдання 1
#
# Створіть набір функцій для роботи з цілим списком чисел. Реалізуйте функції з такою функціональністю:
#
# функція для обчислення суми елементів списку;
# функція для обчислення середнього арифметичного елементів списку;
# функція для знаходження максимального елемента списку;
# функція для знаходження мінімального елемента списку.
#
# Протестуйте всі створені функції, використовуючи pytest.
#
# Завдання 2
#
# Створіть набір функцій для роботи з рядками. Реалізуйте функції з такою функціональністю:
#
# функція для переведення рядка у верхній регістр (усі літери великі);
# функція для переведення рядка у нижній регістр (усі літери малі);
# функція для підрахунку кількості голосних у рядку;
# функція для перевертання рядка (наприклад, "python" → "nohtyp").
#
# Протестуйте всі створені функції, використовуючи pytest.
#